benchmark.txt
====== PING_INLINE ======
  1000000 requests completed in 9.20 seconds
  200 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.287 milliseconds (cumulative count 2)
50.000% <= 0.927 milliseconds (cumulative count 579605)
75.000% <= 0.943 milliseconds (cumulative count 823113)
87.500% <= 0.951 milliseconds (cumulative count 893706)
93.750% <= 0.967 milliseconds (cumulative count 956356)
96.875% <= 0.983 milliseconds (cumulative count 974484)
98.438% <= 1.023 milliseconds (cumulative count 984453)
99.219% <= 1.135 milliseconds (cumulative count 993012)
99.609% <= 1.207 milliseconds (cumulative count 996264)
99.805% <= 1.311 milliseconds (cumulative count 998133)
99.902% <= 1.479 milliseconds (cumulative count 999029)
99.951% <= 1.591 milliseconds (cumulative count 999540)
99.976% <= 1.735 milliseconds (cumulative count 999762)
99.988% <= 1.927 milliseconds (cumulative count 999878)
99.994% <= 2.695 milliseconds (cumulative count 999939)
99.997% <= 3.063 milliseconds (cumulative count 999970)
99.998% <= 3.239 milliseconds (cumulative count 999985)
99.999% <= 3.327 milliseconds (cumulative count 999993)
100.000% <= 3.375 milliseconds (cumulative count 999997)
100.000% <= 3.407 milliseconds (cumulative count 999999)
100.000% <= 3.431 milliseconds (cumulative count 1000000)
100.000% <= 3.431 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 0.303 milliseconds (cumulative count 3)
0.002% <= 0.407 milliseconds (cumulative count 17)
0.003% <= 0.503 milliseconds (cumulative count 32)
0.005% <= 0.607 milliseconds (cumulative count 45)
0.006% <= 0.703 milliseconds (cumulative count 60)
0.008% <= 0.807 milliseconds (cumulative count 77)
18.342% <= 0.903 milliseconds (cumulative count 183420)
98.220% <= 1.007 milliseconds (cumulative count 982196)
99.005% <= 1.103 milliseconds (cumulative count 990049)
99.626% <= 1.207 milliseconds (cumulative count 996264)
99.803% <= 1.303 milliseconds (cumulative count 998027)
99.868% <= 1.407 milliseconds (cumulative count 998678)
99.918% <= 1.503 milliseconds (cumulative count 999178)
99.956% <= 1.607 milliseconds (cumulative count 999564)
99.974% <= 1.703 milliseconds (cumulative count 999737)
99.983% <= 1.807 milliseconds (cumulative count 999826)
99.987% <= 1.903 milliseconds (cumulative count 999875)
99.988% <= 2.007 milliseconds (cumulative count 999883)
99.989% <= 2.103 milliseconds (cumulative count 999891)
99.997% <= 3.103 milliseconds (cumulative count 999973)
100.000% <= 4.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 108742.93 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.927     0.280     0.927     0.967     1.103     3.431
====== PING_MBULK ======
  1000000 requests completed in 9.32 seconds
  200 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.279 milliseconds (cumulative count 1)
50.000% <= 0.935 milliseconds (cumulative count 579585)
75.000% <= 0.951 milliseconds (cumulative count 783919)
87.500% <= 0.967 milliseconds (cumulative count 885234)
93.750% <= 1.007 milliseconds (cumulative count 942400)
96.875% <= 1.119 milliseconds (cumulative count 969324)
98.438% <= 1.343 milliseconds (cumulative count 984611)
99.219% <= 1.711 milliseconds (cumulative count 992193)
99.609% <= 2.191 milliseconds (cumulative count 996123)
99.805% <= 2.479 milliseconds (cumulative count 998092)
99.902% <= 2.623 milliseconds (cumulative count 999025)
99.951% <= 2.943 milliseconds (cumulative count 999550)
99.976% <= 2.991 milliseconds (cumulative count 999775)
99.988% <= 3.023 milliseconds (cumulative count 999884)
99.994% <= 3.063 milliseconds (cumulative count 999946)
99.997% <= 3.087 milliseconds (cumulative count 999977)
99.998% <= 3.239 milliseconds (cumulative count 999985)
99.999% <= 3.351 milliseconds (cumulative count 999993)
100.000% <= 3.407 milliseconds (cumulative count 999997)
100.000% <= 3.439 milliseconds (cumulative count 999999)
100.000% <= 3.447 milliseconds (cumulative count 1000000)
100.000% <= 3.447 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 0.303 milliseconds (cumulative count 4)
0.002% <= 0.407 milliseconds (cumulative count 17)
0.003% <= 0.503 milliseconds (cumulative count 30)
0.005% <= 0.607 milliseconds (cumulative count 46)
0.006% <= 0.703 milliseconds (cumulative count 62)
0.023% <= 0.807 milliseconds (cumulative count 226)
15.988% <= 0.903 milliseconds (cumulative count 159880)
94.240% <= 1.007 milliseconds (cumulative count 942400)
96.680% <= 1.103 milliseconds (cumulative count 966804)
97.849% <= 1.207 milliseconds (cumulative count 978485)
98.346% <= 1.303 milliseconds (cumulative count 983460)
98.638% <= 1.407 milliseconds (cumulative count 986375)
98.857% <= 1.503 milliseconds (cumulative count 988572)
99.043% <= 1.607 milliseconds (cumulative count 990428)
99.207% <= 1.703 milliseconds (cumulative count 992070)
99.352% <= 1.807 milliseconds (cumulative count 993525)
99.434% <= 1.903 milliseconds (cumulative count 994341)
99.495% <= 2.007 milliseconds (cumulative count 994947)
99.561% <= 2.103 milliseconds (cumulative count 995614)
99.998% <= 3.103 milliseconds (cumulative count 999978)
100.000% <= 4.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 107250.10 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.951     0.272     0.935     1.023     1.591     3.447
====== SET ======
  1000000 requests completed in 20.68 seconds
  200 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.359 milliseconds (cumulative count 1)
50.000% <= 4.047 milliseconds (cumulative count 506051)
75.000% <= 4.303 milliseconds (cumulative count 751551)
87.500% <= 4.583 milliseconds (cumulative count 875899)
93.750% <= 4.759 milliseconds (cumulative count 939103)
96.875% <= 4.975 milliseconds (cumulative count 968982)
98.438% <= 5.247 milliseconds (cumulative count 984678)
99.219% <= 5.471 milliseconds (cumulative count 992254)
99.609% <= 5.839 milliseconds (cumulative count 996157)
99.805% <= 6.359 milliseconds (cumulative count 998052)
99.902% <= 6.855 milliseconds (cumulative count 999030)
99.951% <= 7.423 milliseconds (cumulative count 999513)
99.976% <= 7.911 milliseconds (cumulative count 999756)
99.988% <= 8.295 milliseconds (cumulative count 999888)
99.994% <= 8.407 milliseconds (cumulative count 999939)
99.997% <= 8.479 milliseconds (cumulative count 999990)
99.999% <= 8.487 milliseconds (cumulative count 999994)
100.000% <= 8.511 milliseconds (cumulative count 999999)
100.000% <= 8.519 milliseconds (cumulative count 1000000)
100.000% <= 8.519 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 1.407 milliseconds (cumulative count 8)
0.002% <= 1.503 milliseconds (cumulative count 19)
0.003% <= 1.607 milliseconds (cumulative count 30)
0.004% <= 1.703 milliseconds (cumulative count 40)
0.011% <= 1.807 milliseconds (cumulative count 107)
0.015% <= 1.903 milliseconds (cumulative count 151)
0.017% <= 2.007 milliseconds (cumulative count 175)
0.020% <= 2.103 milliseconds (cumulative count 204)
0.105% <= 3.103 milliseconds (cumulative count 1055)
57.691% <= 4.103 milliseconds (cumulative count 576909)
97.627% <= 5.103 milliseconds (cumulative count 976267)
99.725% <= 6.103 milliseconds (cumulative count 997248)
99.935% <= 7.103 milliseconds (cumulative count 999349)
99.981% <= 8.103 milliseconds (cumulative count 999811)
100.000% <= 9.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 48362.91 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.130     1.352     4.047     4.823     5.391     8.519
====== GET ======
  1000000 requests completed in 20.21 seconds
  200 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.935 milliseconds (cumulative count 3)
50.000% <= 3.927 milliseconds (cumulative count 501571)
75.000% <= 4.143 milliseconds (cumulative count 753263)
87.500% <= 4.487 milliseconds (cumulative count 875003)
93.750% <= 4.727 milliseconds (cumulative count 940256)
96.875% <= 4.847 milliseconds (cumulative count 968974)
98.438% <= 5.143 milliseconds (cumulative count 984777)
99.219% <= 5.287 milliseconds (cumulative count 992320)
99.609% <= 5.495 milliseconds (cumulative count 996178)
99.805% <= 5.855 milliseconds (cumulative count 998068)
99.902% <= 6.151 milliseconds (cumulative count 999025)
99.951% <= 6.511 milliseconds (cumulative count 999530)
99.976% <= 6.623 milliseconds (cumulative count 999758)
99.988% <= 6.783 milliseconds (cumulative count 999884)
99.994% <= 6.951 milliseconds (cumulative count 999940)
99.997% <= 7.063 milliseconds (cumulative count 999971)
99.998% <= 7.087 milliseconds (cumulative count 999986)
99.999% <= 7.103 milliseconds (cumulative count 999998)
100.000% <= 7.111 milliseconds (cumulative count 1000000)
100.000% <= 7.111 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 2.007 milliseconds (cumulative count 25)
0.005% <= 2.103 milliseconds (cumulative count 45)
0.040% <= 3.103 milliseconds (cumulative count 403)
72.178% <= 4.103 milliseconds (cumulative count 721780)
98.220% <= 5.103 milliseconds (cumulative count 982202)
99.891% <= 6.103 milliseconds (cumulative count 998911)
100.000% <= 7.103 milliseconds (cumulative count 999998)
100.000% <= 8.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 49490.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.037     1.928     3.927     4.759     5.223     7.111